pokemon-backend/app/controllers/api/v1/pokemons_controller.rb

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def show
    @pokemon = Pokemon.find(pokemon_params)