pokemon-backend/app/controllers/api/v1/teams_controller.rb

SELECT "teams".* FROM "teams"
---
  def index
    @teams = Team.all()

INSERT INTO "teams" ("pokemon_id", "trainer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["pokemon_id", 1], ["trainer_id", 15], ["created_at", "2019-04-15 19:56:15.604901"], ["updated_at", "2019-04-15 19:56:15.604901"]]
---
  def create
    @team = Team.create(team_params)

SELECT "teams".* FROM "teams" WHERE "teams"."trainer_id" = $1  [["trainer_id", nil]]
---
  def find
    @team = Team.where(trainer_id: params[:trainer_id])