pokemon-backend/app/controllers/api/v1/trainers_controller.rb

  def index
    @trainers = Trainer.all
---
SELECT "trainers".* FROM "trainers"

  def show
    @trainer = Trainer.find(params[:id])
---
SELECT  "trainers".* FROM "trainers" WHERE "trainers"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def create
    puts trainer_params
    @trainer = Trainer.create(trainer_params)
---
INSERT INTO "trainers" ("name", "hometown", "age", "image", "enemy", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Jessica"], ["hometown", "Jessic"], ["age", 0], ["image", ""], ["enemy", "Jess"], ["created_at", "2019-04-12 20:23:28.441254"], ["updated_at", "2019-04-12 20:23:28.441254"]]

  def edit
    @trainer = Trainer.find_by(params[:id])
---
SELECT  "trainers".* FROM "trainers" WHERE (undefined) LIMIT $1  [["LIMIT", 1]]

  def update
    @trainer = Trainer.find_by(id: params[:id])
---
SELECT  "trainers".* FROM "trainers" WHERE "trainers"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]

  def find
    @trainer = Trainer.find_by(name: params[:name])
---
SELECT  "trainers".* FROM "trainers" WHERE "trainers"."name" = $1 LIMIT $2  [["name", "test4"], ["LIMIT", 1]]