pokemon-backend/app/controllers/api/v1/trainers_controller.rb

  def update
    @trainer = Trainer.find_by(params[:id])
---
SELECT  "trainers".* FROM "trainers" WHERE (undefined) LIMIT $1  [["LIMIT", 1]]